<!DOCTYPE html>
<html lang='cn'>

<head>
  <?php include($_SERVER['DOCUMENT_ROOT'] . '/cn/lang.php') ?>
  <title>服务条款 | TDengine</title>
  <meta name='description' content='TDengine是涛思数据推出的一款开源的专为物联网、车联网、工业互联网、IT运维等设计和优化的大数据平台。除核心的快10倍以上的时序数据库功能外，还提供缓存、数据订阅、流式计算等功能，最大程度减少研发和运维的工作量。'>
  <meta name='keywords' content='大数据，Big Data，开源，物联网，车联网，工业互联网，IT运维, 时序数据库，涛思数据，TAOS Data, TDengine'>
  <meta name='title' content='服务条款 | TDengine'>
  <meta property='og:site_name' content='涛思数据 | TDengine' />
  <meta property='og:title' content='服务条款 | TDengine' />
  <meta property='og:type' content='article' />
  <meta property='og:url' content='https://www.taosdata.com/terms-of-service' />
  <meta property='og:description' content='TDengine是涛思数据推出的一款开源的专为物联网、车联网、工业互联网、IT运维等设计和优化的大数据平台。除核心的快10倍以上的时序数据库功能外，还提供缓存、数据订阅、流式计算等功能，最大程度减少研发和运维的工作量。' />
  <?php $s=$_SERVER['DOCUMENT_ROOT']."/$lang";include($s.'/head.php');?>
  <link rel='canonical' href='https://www.taosdata.com/terms-of-service/' />
  <link rel='stylesheet' href='/lib/docs/docs.css'>
</head>

<body>
  <?php include($s.'/header.php'); ?>
  <div class='container-fluid'>
    <main class='content-wrapper'>
      <section class='documentation'>
        <h1>服务条款</h1>
<p>本服务条款是用户在使用北京涛思数据科技有限公司（下称“涛思数据”）提供的服务或访问涛思数据网站时与涛思数据之间的协议。涛思数据服务由涛思数据的SaaS服务与涛思数据网站提供，包括但不限于物联网大数据平台服务等（下称“本服务”）。用户使用本服务前，必须认真阅读本服务条款中各条款。用户如不同意本服务条款，则不要使用或主动取消本服务。用户的使用行为将被视为对本服务条款完全接受，包括接受涛思数据对服务条款随时所做的任何修改和变更，此后用户不得以未阅读或未同意本服务条款内容为由做任何形式的抗辩。</p>
<p><strong>知识产权及所有权</strong></p>
<ul>
<li>涛思数据提供的软件：涛思数据拥有用户使用本服务之一切相关软件（以下简称“软件”）的著作权及其它知识产权，用户同意将通过由涛思数据所提供的界面而非任何其他途径取得及使用该软件。在任何情况下，未经涛思数据明示授权，用户均不得修改、出租、出借、出售、散布本软件之任何部分或全部，或据以制作衍生著作，或使用擅自修改后的软件，或进行还原工程、反向编译，或以其他方式发现原始编码，包括但不限于为了未经授权而使用本服务之目的。</li>
<li>涛思数据商标信息：包括涛思数据标志及产品、服务名称及Logo、商标等（以下简称“涛思数据标识”）。未经涛思数据事先书面同意，用户不得将涛思数据标识以任何方式展示、使用、复制、修改、传播或与其它产品捆绑使用或作其他处理，也不得向他人表明用户有权展示、使用或其他有权处理涛思数据标识的行为。</li>
<li>其他信息内容包括：文字、声音、相片、录像、图表、网页、广告中部分或全部内容、涛思数据为用户提供的商业信息等。所有这些内容的知识产权依具体情况分别为涛思数据、其内容提供商及第三方许可人所有，均受著作权、商标权和其它知识产权等法律法规的保护。用户只能在涛思数据和相关权利人授权下才能使用这些内容，而不能擅自使用、抄袭、复制、修改、编撰这些内容或创造与内容有关的衍生产品。</li>

</ul>
<p><strong>用户使用规则</strong></p>
<ul>
<li>用户必须自行配备上网和无线上网所需的设备（包括PC机和手机），自行负担电脑或手机上网（包括但不限于宽带或移动通信提供商）的通讯费、信息费等有关费用。我们建议您与您的通讯服务提供商确认相关的费用问题。</li>
<li>用户必须保证自己在使用本服务时身份的真实性、正确性及完整性，如果资料发生变化，应及时更改。在成功下载安装涛思数据手机客户端软件后，将获得一账号密码，用户应维持帐号及密码的机密安全。用户应对任何人利用其密码及帐号所进行的活动负完全的责任，涛思数据无法对非法或未经用户授权使用用户帐号及密码的行为作出甄别，如用户因用户账号及密码盗用、遗失而受到任何损害，涛思数据对此不承担任何责任。</li>
<li>除涛思数据事前同意或用户与涛思数据另有约定外，用户同意本服务仅供个人使用且非商业性质的使用，用户不得对本服务任何部分进行复制、拷贝、出售或利用本服务进行调查、广告或用于其他商业目的，其中，用户不得将任何广告信函与信息、促销资料、滥发邮件与信息、直销及传销邮件与信息上传或传播。</li>
<li>用户不得发布任何妨碍社会治安或非法、虚假、骚扰性、侮辱性、恐吓性、伤害性、破坏性、挑衅性、淫秽色情性等内容的信息或使用本服务进行任何非法或犯罪行为。</li>

</ul>
<p><strong>服务风险及免责声明</strong></p>
<ul>
<li>本服务涉及到互联网及移动通讯等服务，可能会受到各个环节不稳定因素的影响，因此本服务存在因不可抗力、计算机病毒或黑客攻击、用户所在位置、用户关机、移动通讯网络、互联网络原因等造成的服务中断或不能满足用户要求的风险。开通服务的用户须承担以上风险，涛思数据及（或）其合作第三方对服务之及时性、安全性、准确性不作任何担保，对因此导致用户不能发送和接受阅读消息或传递错误或个人设定之时效或未予储存等问题引起的用户损失，涛思数据及（或）其合作第三方不承担任何责任。</li>
<li>本服务（含涛思数据软件）不提供任何明示或默示的权利瑕疵或物之瑕疵担保责任，包含但不限于商业适售性、特定目的之适用性及未侵害他人权利等担保或保证。如用户受到任何第三人就本服务或与本服务有关事项主张权利时，用户应自行解决，涛思数据不承担任何责任。</li>
<li>涛思数据有权制订一些限制措施，包含但不限于保留用户信息、手机信息或其他上载内容之最长期间。通过本服务存储或传送之任何信息、资料和其他内容，如被删除或未予储存，用户同意涛思数据无需承担任何责任。用户亦同意，长时间未使用的帐号，涛思数据有权关闭并收回帐号。用户也同意，涛思数据有权依其自行之考量，不论通知与否，随时变更这些一般措施及限制。 </li>
<li>链接服务：本服务或第三方可提供与其他互联网上之网站或资源之链接，由于涛思数据无法控制这些网站及资源，无论此类网站或资源是否可供利用，涛思数据不予负责；涛思数据亦对存在或源于此类网站或资源之任何内容、广告、产品或其他资料不予保证或负责。因用户使用或依赖任何此类网站或资源发布的或经由此类网站或资源获得的任何内容、商品或服务所产生的任何损害或损失，或认为该链接所载的内容侵犯自身权利，涛思数据不负任何直接或间接之责任。</li>

</ul>
<p><strong>隐私权保护</strong></p>
<p>涛思数据重视对用户隐私的保护，保护隐私是涛思数据的一项基本政策，详细请看隐私条款。 </p>
<p><strong>服务条款的修改</strong></p>
<p>涛思数据有权在必要时修改本服务条款，并在涛思数据网站上公布，一经公布即视为通知。修改后的服务条款一旦公布即有效代替原来的服务条款。用户可随时登陆涛思数据网站查阅最新版服务条款。客户如不同意修改内容，可停止使用或主动取消涛思数据服务；客户如继续使用涛思数据服务，则视为接受服务条款的修改。</p>
<p><strong>适用法律与司法管辖</strong></p>
<p>本服务条款的制定、执行和解释及争议的解决均应适用中华人民共和国法律。双方因使用本服务所产生的争议，协商不成的，任何一方均可以向涛思数据所在地有管辖权的人民法院提起诉讼。</p>
<p><strong>其它</strong></p>
<p>如本服务条款中的任何条款无论因何种原因完全或部分无效或不具有执行力，本服务条款的其余条款仍应有效且具有约束力。用户须对违反中华人民共和国法律规定及本服务条款所产生的一切后果承担法律责任。本服务的内容、收费标准及收费方式应以涛思数据发布的通知为准。 用户对本服务之任何部分或本服务条款的任何部分之意见及建议可通过涛思数据网站与涛思数据联系。本服务的所有权、运作权及本服务条款之一切解释权归涛思数据。</p>
      </section>
    </main>
  </div>
  <?php include($s.'/footer.php'); ?>
</body>

</html>