<!DOCTYPE html>
<html lang='cn'>

<head>
  <?php include($_SERVER['DOCUMENT_ROOT'] . '/cn/lang.php') ?>
  <title>隐私 | TDengine</title>
  <meta name='description' content='TDengine是涛思数据推出的一款开源的专为物联网、车联网、工业互联网、IT运维等设计和优化的大数据平台。除核心的快10倍以上的时序数据库功能外，还提供缓存、数据订阅、流式计算等功能，最大程度减少研发和运维的工作量。'>
  <meta name='keywords' content='大数据，Big Data，开源，物联网，车联网，工业互联网，IT运维, 时序数据库，涛思数据，TAOS Data, TDengine'>
  <meta name='title' content='隐私 | TDengine'>
  <meta property='og:site_name' content='涛思数据 | TDengine' />
  <meta property='og:title' content='隐私 | TDengine' />
  <meta property='og:type' content='article' />
  <meta property='og:url' content='https://www.taosdata.com/<?php echo $lang; ?>/privacy' />
  <meta property='og:description' content='TDengine是涛思数据推出的一款开源的专为物联网、车联网、工业互联网、IT运维等设计和优化的大数据平台。除核心的快10倍以上的时序数据库功能外，还提供缓存、数据订阅、流式计算等功能，最大程度减少研发和运维的工作量。' />
  <?php $s=$_SERVER['DOCUMENT_ROOT']."/$lang";include($s.'/head.php');?>
  <link rel='canonical' href='https://www.taosdata.com/<?php echo $lang; ?>/privacy' />
  <link rel='stylesheet' href='/lib/docs/docs.css'>
</head>

<body>
  <?php include($s.'/header.php'); ?>
  <div class='container-fluid'>
    <main class='content-wrapper'>
      <section class='documentation'>
        <h1>隐私政策</h1>
        <p><em>最近更新日期：2019年7月9日</em></p>
        <p>涛思数据（以下或称为“我们”）尊重并保护用户信息，并且将以高度勤勉和审慎的义务对待这些信息。在您使用了涛思数据网站提供的服务时，我们将按照本隐私权政策收集、处理及披露您的信息。我们希望通过本隐私权政策向您清晰地介绍我们对您信息的处理方式，因此我们建议您完整地阅读本隐私权政策，以帮助您了解维护自己隐私权的方式。</p>
        <p><strong>我们收集的信息</strong></p>
        <p>在您浏览我们网站或使用我们服务过程中，我们会收集以下的信息：</p>
        <ul>
          <li>账户信息：您浏览网站或使用服务时提供的邮件地址、姓名、公司、地址等信息</li>
          <li>设备信息：我们会自动接收并记录您所使用的设备相关信息、设备所在位置相关信息。</li>
          <li>日志信息：当您使用我们的网站或客户端提供的服务时，我们会自动收集您对我们服务的详细使用情况，作为有关网络日志保存。</li>
          <li>用户账户的支持信息：基于您使用涛思数据服务而产生的用户的咨询记录、报障记录和针对用户故障的排障过程（如通信或通话记录），涛思数据将通过记录、分析这些信息以便更及时响应您的帮助请求，以及用于改进服务。</li>
        </ul>
        <p><strong>我们使用您的用户信息的情形</strong></p>
        <p>我们出于如下目的，使用您提交以及我们收集的用户信息</p>
        <ul>
          <li>为了向您提供服务，我们会向您发送信息、通知或与您进行业务沟通，包括但不限于为保证服务完成所必须的验证码、使用服务时所必要的推送通知；</li>
          <li>为了维护、改进服务，向您提供更符合您个性化需求的信息展示，我们可能将来自涛思数据网站某项服务的用户信息与来自其他项服务的信息结合起来，做出特征模型并进行用户画像，向您展示、推送信息和可能的商业广告，包括但不限于关于涛思数据产品的新闻以及市场活动及优惠促销信息、涛思数据合作第三方的推广信息，或其他您可能感兴趣的内容。如果您不想接收我们给您发送的商业性电子信息，您可通过短信提示回复退订或根据信息中提供的退订方式予以退订；</li>
          <li>我们可能以用户信息统计数据为基础，设计、开发、推广全新的产品及服务；我们会对我们的服务使用情况进行统计，并可能会与公众或第三方分享这些统计信息，但这些统计信息不包含您的任何身份识别信息；</li>
          <li>为提高您使用我们及我们关联公司、合作伙伴提供服务的安全性，确保操作环境安全与识别账号异常状态，保护您或其他用户或公众的人身财产安全免遭侵害，更好地预防钓鱼网站、欺诈、网络漏洞、计算机病毒、网络攻击、网络侵入等安全风险，更准确地识别违反法律法规或涛思数据相关协议、规则的情况，我们可能使用您的会员信息、并整合设备信息、有关网络日志以及我们关联公司、合作伙伴合法分享的信息，来判断您账户及交易风险、进行身份验证、安全事件的检测及防范，并依法采取必要的记录、审计、分析、处置措施；</li>
        </ul>
        <p><strong>我们如何共享您的用户信息</strong></p>
        <p>我们不会与其他组织和个人共享您的用户信息，但以下情况除外：</p>
        <ul>
          <li>在获取明确同意的情况下共享：获得您的明确同意后，我们会与其他方共享您的用户信息</li>
          <li>在法定情形下的共享：我们可能会根据法律法规规定、诉讼、仲裁解决需要，或按行政、司法机关依法提出的要求，对外共享您的用户信息；</li>
          <li>为了促成交易或协助解决争议，某些情况下只有共享您的用户信息，才能促成交易或处理您与他人的纠纷或争议，例如，在涛思数据云市场上创建的某一交易中，如交易任何一方履行或部分履行了交易义务并提出信息披露请求的，涛思数据有权决定向该用户提供其交易对方的联络方式等必要信息，以促成交易的完成；</li>
          <li>与授权合作伙伴共享：我们可能委托受信赖的合作伙伴来提供服务，因此我们可能会与合作伙伴共享您的某些用户信息，以提供更好的客户服务和优化用户体验。我们仅会出于合法、正当、必要、特定、明确的目的共享您的用户信息，并且只会共享提供服务所必要的用户信息。我们的合作伙伴无权将共享的用户信息用于任何其他用途。</li>
          <li>在涛思数据与其他法律主体者发生合并、收购或破产清算情形，或其他涉及合并、收购或破产清算情形时，如涉及到用户信息转让，我们会要求新的持有您用户信息的公司、组织继续受本政策的约束，否则我们将要求该公司、组织和个人重新向您征求授权同意。</li>
          <li>为保护涛思数据平台及其关联公司用户或公众的人身财产安全免遭侵害，我们可能依据适用的法律或涛思数据平台相关协议、规则披露关于您的用户信息。</li>
        </ul>
        <p><strong>我们如何使用Cookie 和同类技术</strong></p>
        <ul>
          <li>为确保网站正常运转、为您获得更轻松的访问体验、向您推荐您可能感兴趣的内容，我们会在您的计算机或移动设备上存储名为 Cookie 的小数据文件。Cookie 通常包含标识符、站点名称以及一些号码和字符。涛思数据只能读取涛思数据提供的cookies。</li>
          <li>借助于 Cookie，能够存储您的偏好。当下一次您再次访问的时候，我们将显示您需要的信息；或由涛思数据通过cookies文件来辨识您的来源网站，以便涛思数据能追踪涛思数据的广告效果。</li>
          <li>您可根据自己的偏好管理Cookie，您也可以清除计算机上保存的所有 Cookie。大部分网络浏览器都设有阻止 Cookie 的功能。但如果您这么做，则需要在每一次访问我们的网站时更改用户设置。如需详细了解如何更改浏览器设置，请访问您使用的浏览器的相关设置页面。</li>
          <li>我们还会在网站上使用网站信标和像素标签等其他同类技术。例如，我们向您发送的电子邮件可能含有链接至我们网站内容的地址链接，如果您点击该链接，我们则会跟踪此次点击，帮助我们了解您的产品或服务偏好以便于我们主动改善客户服务体验。网站信标通常是一种嵌入到网站或电子邮件中的透明图像。借助于电子邮件中的像素标签，我们能够获知电子邮件是否被打开。如果您不希望自己的活动以这种方式被追踪，则可以随时从我们的寄信名单中退订。</li>
        </ul>
        <p><strong>我们如何保护和保存您的用户信息</strong></p>
        <ul>
          <li>涛思数据非常重视您的信息安全。我们努力采取各种合理的物理、电子和管理方面的安全措施来保护您的用户信息。防止用户信息遭到未经授权访问、公开披露、使用、修改、损坏或丢失。我们会使用加密技术提高用户信息的安全性；我们会使用受信赖的保护机制防止用户信息遭到恶意攻击；我们会部署访问控制机制，尽力确保只有授权人员才可访问用户信息；以及我们会举办安全和隐私保护培训课程，加强员工对于保护用户信息重要性的认识。</li>
          <li>我们会采取合理可行的措施，尽力避免收集无关的用户信息。我们只会在达成本政策所述目的所需的期限内保留您的用户信息，除非受到法律的允许。超出上述用户信息保存期限后，我们会对您的个人信息进行删除或匿名化处理。</li>
          <li>请使用复杂密码，协助我们保证您的账号安全。我们将尽力保障您发送给我们的任何信息的安全性。如果我们的物理、技术或管理防护设施遭到破坏，导致信息被非授权访问、公开披露、篡改或毁坏，导致您的合法权益受损，我们将承担相应的法律责任。</li>
          <li>在不幸发生用户信息安全事件（泄露、丢失等）后，我们将按照法律法规的要求，及时向您告知：安全事件的基本情况和可能的影响、我们已采取或将要采取的处置措施、您可自主防范和降低风险的建议、对您的补救措施等。我们将及时将事件相关情况以邮件、信函、电话、推送通知等方式告知您，难以逐一告知用户信息主体时，我们会采取合理、有效的方式发布公告。</li>
          <li>同时，我们还将按照监管部门要求，上报用户信息安全事件的处置情况。</li>
          <li>我们将收集到的您的用户信息存放在中华人民共和国境内，如在符合适用法律规定的情形下因业务需要向境外传输个人信息的，我们会事先征得您的同意，并向您告知用户信息出境的目的、接收方、安全保障措施、安全风险等情况。</li>
          <li>如出现涛思数据产品和服务停止运营的情形，我们会采取合理措施保护您用户信息安全，包括及时停止继续收集用户信息的活动；停止运营的通知将以逐一送达或公告的形式通知用户；并对所持有的个人信息进行删除或匿名化处理等。</li>
        </ul>
        <p><strong>隐私权政策的更新</strong></p>
        <p>我们的隐私权政策可能修订。未经您明确同意，我们不会限制您按照本隐私权政策所应享有的权利。我们会在<a href="https://help.aliyun.com/product/67275.html?spm=a2c4g.750001.27.11.121e7b13M492WM"><strong>专门页面</strong></a>上发布对隐私权政策所做的任何修订。对于重大修订，我们还会提供更为显著的通知（包括对于某些服务，我们会通过网站公示的方式进行通知甚至向您提供弹窗提示，说明隐私权政策的具体变更内容）。</p>
      </section>
    </main>
  </div>
  <?php include($s.'/footer.php'); ?>
</body>

</html>